$.extend($.fn.validatebox.defaults.rules, {
    /*必须和某个字段相等*/
    equalTo: {validator: function (value, param) { return $(param[0]).val() == value; }, message: '字段不匹配' },
    password: {
        validator: function (value, param) {
        	//1、正则表达式验证数字、字母、特殊字符的组合，这个要求3者都有
        	//var reg=/(?=.*[a-z])(?=.*\d)(?=.*[#@!~%^&*])[a-z\d#@!~%^&*]{6,24}/i
        	//特殊 字符 为~!@#$%^&*其中之一
        	//2、正则表达式验证（数字+字母）或者（数字+特殊字符）或者（字母+特殊字符），不能是纯数字、纯字母、纯特殊字符，即只要符合这3个组合其中之一都为true
        	//var reg=/((?=.*[a-z])(?=.*\d)|(?=[a-z])(?=.*[#@!~%^&*])|(?=.*\d)(?=.*[#@!~%^&*]))[a-z\d#@!~%^&*]{6,24}/i
        	
        	if (!/((?=.*[a-zA-Z])(?=.*\d)|(?=[a-zA-Z])(?=.*[`~!@#\$%\^&\*\(\)_\+<>\?:\"{},\.\/;'\[\]])|(?=.*\d)(?=.*[`~!@#\$%\^&\*\(\)_\+<>\?:\"{},\.\/;'\[\]])|(?=.*[a-zA-Z])(?=.*\d)(?=.*[`~!@#\$%\^&\*\(\)_\+<>\?:\"{},\.\/;'\[\]]))[a-zA-Z\d`~!@#\$%\^&\*\(\)_\+<>\?:\"{},\.\/;'\[\]]{6,24}/.test(value)) {  
                $.fn.validatebox.defaults.rules.password.message = '密码不能过于简单，必须由字母、数字、特殊符号中的2种或者3种组合而成，长度为6~24个字符。';  
                return false;  
            } else {  
                return true;  
            }   
        }, message: ''  
    } 
});